app/views/tasks/_form.html.erb

SELECT "kinds".* FROM "kinds"
---
      <%= form.label :kind %>
      <%= collection_select(:task, :kind_id, Kind.all, :id, :name) %>