app/controllers/kinds_controller.rb

SELECT "kinds".* FROM "kinds"
---
  def index
    @kinds = Kind.all

INSERT INTO "kinds" ("name", "size", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "nrekind"], ["size", 26], ["created_at", "2019-10-07 00:23:18.988146"], ["updated_at", "2019-10-07 00:23:18.988146"]]
---
  def create
    @kind = Kind.new(kind_params)
    respond_to do |format|
      if @kind.save

UPDATE "kinds" SET "name" = ?, "updated_at" = ? WHERE "kinds"."id" = ?  [["name", "nrekss"], ["updated_at", "2019-10-07 00:23:28.184843"], ["id", 10]]
---
  def update
    respond_to do |format|
      if @kind.update(kind_params)

SELECT  "kinds".* FROM "kinds" WHERE "kinds"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
---
  def set_kind
    @kind = Kind.find(params[:id])