app/controllers/tasks_controller.rb

  def index
    @tasks = Task.all
---
SELECT "tasks".* FROM "tasks"

  def create
    @task = Task.new(task_params)
    respond_to do |format|
      if @task.save
---
INSERT INTO "tasks" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "sdsadas"], ["description", "sdasdasd"], ["created_at", "2019-10-07 01:24:07.263162"], ["updated_at", "2019-10-07 01:24:07.263162"]]

  def update
    respond_to do |format|
      if @task.update(task_params)
---
UPDATE "tasks" SET "name" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["name", "my task222"], ["updated_at", "2019-10-07 02:05:54.477266"], ["id", 1]]

  def set_task
    @task = Task.find(params[:id])
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]